#### ConnectionResolution Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all the possible resolutions for connectivity validation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public enum ConnectionResolution ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ConnectionResolution ``` |

| Visual C++ |
| --- |
| ``` public enum class ConnectionResolution ``` |

# Members

| Member name | Description |
| --- | --- |
| Disconnected | Value for parts were disconnected. |

# See Also

Autodesk.Revit.DB Namespace